MissingMIT/lecture-1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-13 Mon 02:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lecture 1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Mao" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Lecture 1</h1>
<ul class="org-ul">
<li>tags :MIT: :shell:</li>
</ul>

<div id="outline-container-orge752c10" class="outline-2">
<h2 id="orge752c10">The Shell</h2>
<div class="outline-text-2" id="text-orge752c10">
</div>
<div id="outline-container-orgdd003b1" class="outline-3">
<h3 id="orgdd003b1">Usage</h3>
<div class="outline-text-3" id="text-orgdd003b1">
<ul class="org-ul">
<li><p>
The command <code>date</code> will print the current date.
</p>
<pre class="example">
RESULTS:
Mon 13 Jul 2020 01:16:10 PDT
</pre></li>
<li><p>
Shell commands can also be executed with <i>arguments.</i>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #78DCE8;">echo</span> hello
</pre>
</div>
<pre class="example">
RESULTS:
hello
</pre>


<p>
In this case, <code>echo</code> was the command, and <code>hello</code> was the argument.
The echo command will print out its arguments.
</p>
<ul class="org-ul">
<li>In order to parse arguments which are multiple words long, use <code>'</code> or <code>"</code> .
You could also use <code>\</code> to escape relevant characters.</li>
</ul></li>
</ul>


<ul class="org-ul">
<li><p>
<code>which</code> can be used to find the location of which program is being executed.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #78DCE8;">which</span> python
</pre>
</div>
<pre class="example">
RESULTS:
/usr/bin/python
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-orgf940ad6" class="outline-3">
<h3 id="orgf940ad6">Connecting Programs</h3>
<div class="outline-text-3" id="text-orgf940ad6">
<ul class="org-ul">
<li><p>
Programs contain two streams, an input and an output. Programs will read from the input stream and print into the output stream.
</p>

<p>
This way, it is possible to change the the input or output away from the terminal and reroute those streams.
</p>

<ul class="org-ul">
<li></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Mao</p>
<p class="date">Created: 2020-07-13 Mon 02:03</p>
</div>
</body>
</html>
